; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c8-s2-p14-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 c4 c5 c6 c7 
          t0 t1 t2 t3 t4 t5 t6 t7 
          l0-0 l0-1 l1-0 l1-1 l2-0 l2-1 l3-0 l3-1 l4-0 l4-1 l5-0 l5-1 l6-0 l6-1 l7-0 l7-1 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (CITY c6)
    (CITY c7)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (TRUCK t7)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l6-0)
    (in-city  l6-0 c6)
    (LOCATION l6-1)
    (in-city  l6-1 c6)
    (LOCATION l7-0)
    (in-city  l7-0 c7)
    (LOCATION l7-1)
    (in-city  l7-1 c7)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (AIRPORT l6-0)
    (AIRPORT l7-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (at t0 l0-1)
    (at t1 l1-0)
    (at t2 l2-1)
    (at t3 l3-0)
    (at t4 l4-1)
    (at t5 l5-0)
    (at t6 l6-0)
    (at t7 l7-0)
    (at p0 l1-1)
    (at p1 l0-0)
    (at p2 l1-1)
    (at p3 l4-0)
    (at p4 l7-1)
    (at p5 l2-1)
    (at p6 l3-1)
    (at p7 l6-1)
    (at p8 l6-1)
    (at p9 l5-1)
    (at p10 l6-1)
    (at p11 l4-1)
    (at p12 l3-0)
    (at p13 l5-0)
    (at a0 l4-0)
    (at a1 l7-0)
    (at a2 l0-0)
)
(:goal
    (and
        (at p0 l6-1)
        (at p1 l4-1)
        (at p2 l7-0)
        (at p3 l5-0)
        (at p4 l7-0)
        (at p5 l1-0)
        (at p6 l3-1)
        (at p7 l3-0)
        (at p8 l6-0)
        (at p9 l7-0)
        (at p10 l3-1)
        (at p11 l6-1)
        (at p12 l6-0)
        (at p13 l2-1)
    )
)

  (:constraints
    (and
      (always (not (in p4 a0)))
      (always (not (in p4 a1)))
      (always (not (in p4 a2)))
      (always (not (in p6 a0)))
      (always (not (in p6 a1)))
      (always (not (in p6 a2)))
      (always (not (in p8 a0)))
      (always (not (in p8 a1)))
      (always (not (in p8 a2)))
    )
  )
)

; plan
1. (load-airplane p1 a2 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 a2)
   goals met: 1 of 14
2. (load-airplane p3 a0 l4-0)
   deleted: (at p3 l4-0)
   added: (in p3 a0)
   goals met: 1 of 14
3. (load-truck p11 t4 l4-1)
   deleted: (at p11 l4-1)
   added: (in p11 t4)
   goals met: 1 of 14
4. (load-truck p5 t2 l2-1)
   deleted: (at p5 l2-1)
   added: (in p5 t2)
   goals met: 1 of 14
5. (drive-truck t7 l7-0 l7-1 c7)
   deleted: (at t7 l7-0)
   added: (at t7 l7-1)
   goals met: 1 of 14
6. (drive-truck t6 l6-0 l6-1 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-1)
   goals met: 1 of 14
7. (drive-truck t5 l5-0 l5-1 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 1 of 14
8. (fly-airplane a1 l7-0 l5-0)
   deleted: (at a1 l7-0)
   added: (at a1 l5-0)
   goals met: 1 of 14
9. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 14
10. (fly-airplane a2 l0-0 l4-0)
   deleted: (at a2 l0-0)
   added: (at a2 l4-0)
   goals met: 1 of 14
11. (load-truck p4 t7 l7-1)
   deleted: (at p4 l7-1)
   added: (in p4 t7)
   goals met: 1 of 14
12. (load-truck p8 t6 l6-1)
   deleted: (at p8 l6-1)
   added: (in p8 t6)
   goals met: 1 of 14
13. (load-truck p7 t6 l6-1)
   deleted: (at p7 l6-1)
   added: (in p7 t6)
   goals met: 1 of 14
14. (load-truck p10 t6 l6-1)
   deleted: (at p10 l6-1)
   added: (in p10 t6)
   goals met: 1 of 14
15. (load-truck p9 t5 l5-1)
   deleted: (at p9 l5-1)
   added: (in p9 t5)
   goals met: 1 of 14
16. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 1 of 14
17. (load-airplane p13 a1 l5-0)
   deleted: (at p13 l5-0)
   added: (in p13 a1)
   goals met: 1 of 14
18. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 1 of 14
19. (load-truck p2 t1 l1-1)
   deleted: (at p2 l1-1)
   added: (in p2 t1)
   goals met: 1 of 14
20. (load-truck p0 t1 l1-1)
   deleted: (at p0 l1-1)
   added: (in p0 t1)
   goals met: 1 of 14
21. (unload-airplane p1 a2 l4-0)
   deleted: (in p1 a2)
   added: (at p1 l4-0)
   goals met: 1 of 14
22. (drive-truck t7 l7-1 l7-0 c7)
   deleted: (at t7 l7-1)
   added: (at t7 l7-0)
   goals met: 1 of 14
23. (drive-truck t5 l5-1 l5-0 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 1 of 14
24. (unload-truck p11 t4 l4-0)
   deleted: (in p11 t4)
   added: (at p11 l4-0)
   goals met: 1 of 14
25. (unload-truck p5 t2 l2-0)
   deleted: (in p5 t2)
   added: (at p5 l2-0)
   goals met: 1 of 14
26. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 14
27. (drive-truck t6 l6-1 l6-0 c6)
   deleted: (at t6 l6-1)
   added: (at t6 l6-0)
   goals met: 1 of 14
28. (unload-truck p4 t7 l7-0)
   deleted: (in p4 t7)
   added: (at p4 l7-0)
   goals met: 2 of 14
29. (unload-truck p9 t5 l5-0)
   deleted: (in p9 t5)
   added: (at p9 l5-0)
   goals met: 2 of 14
30. (load-airplane p11 a0 l4-0)
   deleted: (at p11 l4-0)
   added: (in p11 a0)
   goals met: 2 of 14
31. (load-truck p1 t4 l4-0)
   deleted: (at p1 l4-0)
   added: (in p1 t4)
   goals met: 2 of 14
32. (unload-truck p7 t6 l6-0)
   deleted: (in p7 t6)
   added: (at p7 l6-0)
   goals met: 2 of 14
33. (unload-truck p10 t6 l6-0)
   deleted: (in p10 t6)
   added: (at p10 l6-0)
   goals met: 2 of 14
34. (fly-airplane a2 l4-0 l7-0)
   deleted: (at a2 l4-0)
   added: (at a2 l7-0)
   goals met: 2 of 14
35. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 2 of 14
36. (fly-airplane a0 l4-0 l6-0)
   deleted: (at a0 l4-0)
   added: (at a0 l6-0)
   goals met: 2 of 14
37. (load-airplane p9 a1 l5-0)
   deleted: (at p9 l5-0)
   added: (in p9 a1)
   goals met: 2 of 14
38. (fly-airplane a2 l7-0 l6-0)
   deleted: (at a2 l7-0)
   added: (at a2 l6-0)
   goals met: 2 of 14
39. (unload-truck p1 t4 l4-1)
   deleted: (in p1 t4)
   added: (at p1 l4-1)
   goals met: 3 of 14
40. (unload-airplane p11 a0 l6-0)
   deleted: (in p11 a0)
   added: (at p11 l6-0)
   goals met: 3 of 14
41. (fly-airplane a1 l5-0 l2-0)
   deleted: (at a1 l5-0)
   added: (at a1 l2-0)
   goals met: 3 of 14
42. (load-airplane p7 a2 l6-0)
   deleted: (at p7 l6-0)
   added: (in p7 a2)
   goals met: 3 of 14
43. (load-airplane p10 a2 l6-0)
   deleted: (at p10 l6-0)
   added: (in p10 a2)
   goals met: 3 of 14
44. (fly-airplane a0 l6-0 l5-0)
   deleted: (at a0 l6-0)
   added: (at a0 l5-0)
   goals met: 3 of 14
45. (unload-truck p8 t6 l6-0)
   deleted: (in p8 t6)
   added: (at p8 l6-0)
   goals met: 4 of 14
46. (load-truck p11 t6 l6-0)
   deleted: (at p11 l6-0)
   added: (in p11 t6)
   goals met: 4 of 14
47. (unload-airplane p13 a1 l2-0)
   deleted: (in p13 a1)
   added: (at p13 l2-0)
   goals met: 4 of 14
48. (fly-airplane a2 l6-0 l3-0)
   deleted: (at a2 l6-0)
   added: (at a2 l3-0)
   goals met: 4 of 14
49. (unload-airplane p3 a0 l5-0)
   deleted: (in p3 a0)
   added: (at p3 l5-0)
   goals met: 5 of 14
50. (drive-truck t6 l6-0 l6-1 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-1)
   goals met: 5 of 14
51. (fly-airplane a1 l2-0 l7-0)
   deleted: (at a1 l2-0)
   added: (at a1 l7-0)
   goals met: 5 of 14
52. (load-truck p13 t2 l2-0)
   deleted: (at p13 l2-0)
   added: (in p13 t2)
   goals met: 5 of 14
53. (unload-airplane p7 a2 l3-0)
   deleted: (in p7 a2)
   added: (at p7 l3-0)
   goals met: 6 of 14
54. (unload-airplane p10 a2 l3-0)
   deleted: (in p10 a2)
   added: (at p10 l3-0)
   goals met: 6 of 14
55. (load-airplane p12 a2 l3-0)
   deleted: (at p12 l3-0)
   added: (in p12 a2)
   goals met: 6 of 14
56. (unload-truck p11 t6 l6-1)
   deleted: (in p11 t6)
   added: (at p11 l6-1)
   goals met: 7 of 14
57. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 7 of 14
58. (unload-airplane p9 a1 l7-0)
   deleted: (in p9 a1)
   added: (at p9 l7-0)
   goals met: 8 of 14
59. (load-truck p10 t3 l3-0)
   deleted: (at p10 l3-0)
   added: (in p10 t3)
   goals met: 8 of 14
60. (fly-airplane a2 l3-0 l6-0)
   deleted: (at a2 l3-0)
   added: (at a2 l6-0)
   goals met: 8 of 14
61. (fly-airplane a0 l5-0 l7-0)
   deleted: (at a0 l5-0)
   added: (at a0 l7-0)
   goals met: 8 of 14
62. (unload-truck p13 t2 l2-1)
   deleted: (in p13 t2)
   added: (at p13 l2-1)
   goals met: 9 of 14
63. (unload-airplane p12 a2 l6-0)
   deleted: (in p12 a2)
   added: (at p12 l6-0)
   goals met: 10 of 14
64. (fly-airplane a0 l7-0 l1-0)
   deleted: (at a0 l7-0)
   added: (at a0 l1-0)
   goals met: 10 of 14
65. (unload-truck p2 t1 l1-0)
   deleted: (in p2 t1)
   added: (at p2 l1-0)
   goals met: 10 of 14
66. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 10 of 14
67. (fly-airplane a1 l7-0 l2-0)
   deleted: (at a1 l7-0)
   added: (at a1 l2-0)
   goals met: 10 of 14
68. (drive-truck t6 l6-1 l6-0 c6)
   deleted: (at t6 l6-1)
   added: (at t6 l6-0)
   goals met: 10 of 14
69. (unload-truck p10 t3 l3-1)
   deleted: (in p10 t3)
   added: (at p10 l3-1)
   goals met: 11 of 14
70. (load-airplane p5 a1 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a1)
   goals met: 11 of 14
71. (fly-airplane a2 l6-0 l7-0)
   deleted: (at a2 l6-0)
   added: (at a2 l7-0)
   goals met: 11 of 14
72. (load-airplane p2 a0 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 11 of 14
73. (unload-truck p0 t1 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 11 of 14
74. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 11 of 14
75. (fly-airplane a0 l1-0 l7-0)
   deleted: (at a0 l1-0)
   added: (at a0 l7-0)
   goals met: 11 of 14
76. (unload-airplane p5 a1 l1-0)
   deleted: (in p5 a1)
   added: (at p5 l1-0)
   goals met: 12 of 14
77. (unload-airplane p2 a0 l7-0)
   deleted: (in p2 a0)
   added: (at p2 l7-0)
   goals met: 13 of 14
78. (load-airplane p0 a1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a1)
   goals met: 13 of 14
79. (fly-airplane a1 l1-0 l6-0)
   deleted: (at a1 l1-0)
   added: (at a1 l6-0)
   goals met: 13 of 14
80. (unload-airplane p0 a1 l6-0)
   deleted: (in p0 a1)
   added: (at p0 l6-0)
   goals met: 13 of 14
81. (load-truck p0 t6 l6-0)
   deleted: (at p0 l6-0)
   added: (in p0 t6)
   goals met: 13 of 14
82. (drive-truck t6 l6-0 l6-1 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-1)
   goals met: 13 of 14
83. (unload-truck p0 t6 l6-1)
   deleted: (in p0 t6)
   added: (at p0 l6-1)
   goals met: 14 of 14
